Tutorial4/ConedBottomSingle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          4;
        startFace       1307442;
    }
    outlet
    {
        type            patch;
        nFaces          4;
        startFace       1307446;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          34820;
        startFace       1307450;
    }
    drafttube
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          18315;
        startFace       1342270;
    }
)

// ************************************************************************* //
